# Python Intro - Final Exercise

In [2]:
import pyodbc
import pandas as pd
import numpy as np

In [3]:
### In windows, Using a ODBC DNS (predefined connection name)
conn = pyodbc.connect("DSN=College;"
                      "Server=DESKTOP-E6QQ4LT\SQLEXPRESS;"
                      "Database=College;"
                      "Trusted_Connection=yes;")

In [68]:
### Get the students table
students = pd.read_sql("SELECT * FROM Students;",conn) 
students.head(0)

Empty DataFrame
Columns: [Student_id, First_name, Last_name, Gender]
Index: []

In [78]:
departments = pd.read_sql("SELECT * FROM Departments;",conn)
departments.head()

   Department_id Department_name
0              1         English
1              2         Science
2              3            Arts
3              4           Sport

In [77]:
courses = pd.read_sql("SELECT * FROM Courses;",conn)
courses.head()

   Course_id           Course_name  Department_id  Teacher_id
0          1     English Begginers              1          15
1          2      Advanced English              1          15
2          3  Proffesional English              1          15
3          4       Mathematics 101              2           2
4          5   Matematics Advanced              2          13

In [71]:
classroom = pd.read_sql("SELECT * FROM Classroom;",conn)
classroom.head(0)

Empty DataFrame
Columns: [Course_id, Student_id, Degree]
Index: []

# 1. Count the number of students on each department

In [72]:
#inner join classroom with courses
classroom_courses = pd.merge(classroom, 
                             courses[['Course_id', 'Course_name', 'Department_id']], 
                             on='Course_id')
classroom_courses.head(0)

Empty DataFrame
Columns: [Course_id, Student_id, Degree, Course_name, Department_id]
Index: []

In [73]:
#inner join classroom_courses with departments 
classroom_courses_departments = pd.merge(classroom_courses,
                                        departments[['Department_id', 'Department_name']],
                                        on='Department_id')
classroom_courses_departments.head(0)

Empty DataFrame
Columns: [Course_id, Student_id, Degree, Course_name, Department_id, Department_name]
Index: []

In [17]:
#counting the number of students in each department
classroom_courses_departments.groupby('Department_id').agg({'Student_id': pd.Series.nunique})

               Student_id
Department_id
1                      84
2                     200
3                     137
4                      81

# 2. How many students have each course of the English department and the total number of students in the department?

In [51]:
# selecting only the English department
english_dep=classroom_courses_departments[classroom_courses_departments.Department_id<2]
english_dep.head(5)

,Course_id,Student_id,Degree,Course_name,Department_id,Department_name
0,1,202,92.031070,English Begginers,1,English
1,1,12,81.175916,English Begginers,1,English
2,1,232,82.396587,English Begginers,1,English
3,1,123,62.420449,English Begginers,1,English
4,1,274,72.569900,English Begginers,1,English

In [52]:
#counting the number of student in each course
english_dep.groupby(['Department_id','Course_name']).agg({'Student_id': pd.Series.nunique})

                                    Student_id
Department_id Course_name
1             Advanced English              24
              English Begginers             32
              Proffesional English          38

In [67]:
#counting total student in the english department
TotalStudent = english_dep.groupby('Department_id').agg({'Student_id': pd.Series.nunique})
TotalStudent

               Student_id
Department_id
1                      84

## Q3. How many small (<22 students) and large (22+ students) classrooms are needed for the Science department?

In [84]:
#selecting the Science department
science_dep = classroom_courses_departments[classroom_courses_departments.Department_id==2] 
science_dep.head()

,Course_id,Student_id,Degree,Course_name,Department_id,Department_name
94,4,140,86.232603,Mathematics 101,2,Science
95,4,63,78.330508,Mathematics 101,2,Science
96,4,254,75.884974,Mathematics 101,2,Science
97,4,51,75.157585,Mathematics 101,2,Science
98,4,37,80.331178,Mathematics 101,2,Science

In [85]:
#agg of student in each course
science_dep.groupby(['Department_id', 'Course_id']).agg({'Student_id':pd.Series.nunique})

                         Student_id
Department_id Course_id
2             4                  18
              5                  10
              6                  12
              7                  13
              8                  23
              9                  12
              10                 36
              11                 37
              12                 24
              13                 24
              14                 38
              15                 30
              16                 24
              17                 23
              18                 33
              19                 16

## Q4. A feminist student claims that there are more male than female in the College. Justify if the argument is correct

## Q5. For which courses the percentage of male/female students is over 70%?

## Q6. For each department, how many students passed with a grades over 80?

## Q7. For each department, how many students passed with a grades under 60?

## Q8. Rate the teachers by their average student's grades (in descending order).

## Q9. Create a dataframe showing the courses, departments they are associated with, the teacher in each course, and the number of students enrolled in the course (for each course, department and teacher show the names).

## Q10. Create a dataframe showing the students, the number of courses they take, the average of the grades per class, and their overall average (for each student show the student name).